// ვქმნით ფუნქციას სახელად FizzBuzz, ფუნქციას გადაეწოდება სამი პარამეტრი, ესენია: საწყისი რიცხვი, საბოლოვო რიცხვი და მიმართულების აღმნიშნელი,
// მაგალითად მომხმარებელმა შეიყვანა საწყის რიცხვად 1 ხოლო საბოლოვო რიცხვად 30, და მიმათულების აღმნიშნელად პლიუსი, ეს რიცხვები კონსოლშ უნდა დაილოგოს 1 დან 30 ის ჩათვლით ზრდადობით, თუ მომხმარებელმა მინუსი შეიყვანა მაშინ რიცხვები ილოგება კლებადობით,
// ⚠️ მაგრამ ⚠️ ისეთი რიცხვი რომელიც იყოფა სამზე კონსოლში რიცხვის მაგივრად უნდა გამოვიდეს Fizz,
// რიცხვი რომელიც იყოფა 5 ზე კონსოლში რიცხვის მაგივრად უნდა გამოვიდეს Buzz,
// და რიცხვი რომელიც იყოფა როგორც 3 ასევე 5 ზე, კონსოლში უნდა გამოვიდეს FizzBuzz
// ⚠️ მომხმარებელს თვითონ უნდა შეეძლოს რიცხვის შეყვანა, ასევე მიმართულების აღმნიშვნელის ან პლიუსის ან მინუსის რომელიც უზრუნველყოფს
// თუ როგორ დაილოგოს რიცხვები ზრდადობით თუ კლებადობით ⚠️

// ⚠️ თუ მომხმარებელი რიცხვის მაგივრად შეიყვანს სტრინგს, თავიდან უნდა ამოუგდოს შესაყვანი ფრომპთი, გთხოვთ შეიყვანეთ საწყისი რიცხვი,
//  მანამ სანამ მომხმარებელი არ შეიყვანს რიცხვს უნდა ამოვარდეს ერთი და იგივე შესაყვანი ველი, როგორც კი რიცხვს შეიყვანს საწყის უნდა
//   ამოვარდეს მეორე შესაყვანი ველი სადაც ანალოგიურად უნდა შეიყვანოს საბოლოვო რიცხვი, იგივე ლოგიკით მხოლოდ რიცხვის შეყვანა შეეძლოს,
//    და მესამე მიმართულების შესაყვან ველში უნდა შეეძლოს მხოლოდ + ან - ის შეყვანა სხვა შემთხვევაში ხელახლა ამოუგდებს, იგივე ტექსტით რომ
//     შეიყვანოს პლიუსი ან მინუსი.

let start;
let end;
let direction;

while (true) {
  start = prompt("შეიყვანეთ საწყისი რიცხვი");
  if (!isNaN(start)) {
    start = Number(start);
    break;
  }
}
while (true) {
  end = prompt("შეიყვანეთ საბოლოო რიცხვი");
  if (!isNaN(end)) {
    end = Number(end);
    break;
  }
}
while (true) {
  direction = prompt("შეიყვანეტ მიმართულება (- ან +)");
  if (direction == "+" || direction == "-") {
    FizzBuzz(start, end, direction);

    break;
  }
}

function FizzBuzz(startWith, endWith, order) {
  let i;
  for (
    order == "-" ? (i = endWith) : (i = startWith);
    order == "-" ? i >= startWith : i <= endWith;
    order == "+" ? i++ : order == "-" && i--
  ) {
    const result = (i % 3 == 0 ? "fizz" : "") + (i % 5 == 0 ? "buzz" : "") || i;
    console.log(result);
  }
}
